Revit.Elements.Views.View
An abstract Revit View - All view types inherit from this type

Revit.Elements.Views.View.ExportAsImage(System.String)
Export the view as an image to the given path - defaults to png, but you can override
the file type but supplying a path with the appropriate extension
path: A valid path for the image
Returns: The image

Revit.Elements.Views.View.InternalView
Obtain the reference Element as a View